Catalogs/ОтчетМСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ОтчетМСФО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПроцедуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ОтчетМСФО/Forms/ФормаДобавления/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СменаТекущегоОтчета = Ложь;
	МакетОглавления = Справочники.ОтчетМСФО.ПолучитьМакет("Оглавление");
	СписокРазделов = МакетОглавления.ПолучитьОбласть("СписокРазделов");
	Сч = 1;
	Пока Сч <= СписокРазделов.ВысотаТаблицы Цикл
		НовыйРаздел = РазделыИзШаблона.Добавить();
		НовыйРаздел.Название = СписокРазделов.Область("R" + Сч + "C1").Текст;
		НовыйРаздел.ИмяПроцедуры = СписокРазделов.Область("R" + Сч + "C2").Текст;
		НовыйРаздел.НомерСтроки = Сч;
		Сч = Сч + 1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПриАктивизацииСтроки(Элемент)
	Если НЕ СменаТекущегоОтчета Тогда
		СменаТекущегоОтчета = Истина;
		КодСправочника = Элемент.ТекущиеДанные.Код;
		ЗаполнитьРазделыИзОчета(КодСправочника);
		СменаТекущегоОтчета = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделыИзОчета(КодСправочника)
	РазделыИзОтчета.Очистить();
	Отчет = Справочники.ОтчетМСФО.НайтиПоКоду(КодСправочника);
	Если Отчет <> ПредопределенноеЗначение("Справочник.ОтчетМСФО.ПустаяСсылка") Тогда
		РазделыИзОтчета.Загрузить(Отчет.Разделы.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Рез = Новый Структура;
	МассивНомеров = Новый Массив;
	Для каждого Стр из РазделыИзШаблона Цикл
		Если Стр.Выбран Тогда
			МассивНомеров.Добавить(Стр.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Рез.Вставить("Шаблон", МассивНомеров);
	
	МассивНомеров = Новый Массив;
	Для каждого Стр из РазделыИзОтчета Цикл
		Если Стр.Выбран Тогда
			МассивНомеров.Добавить(Стр.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Рез.Вставить("Отчет", МассивНомеров);
	Рез.Вставить("ОтчетКод", КодСправочника);
	
	Закрыть(Рез);
КонецПроцедуры
